# print("Hello world")
# print('Hello world')

# login = "admin"
# password = 'qwerty'
# line = "I\n\t\\Love\\\n\t\t\"Python\""
# line2 = "\\n - перехід на новий рядок"
# raw_line = r"\n - перехід на новий рядок"
# img = '''
#                                          ..:^~!!77!!~^:..                                          
#                                   ..  :5&@@@@@@@@@@@@@@@@@@&P~ .^.                                  
#                                 .~?Y. 57~P@@@@@@@@@@@@@@@&Y!~ :#&BPJ~.                              
#                           .:!?Y5GGBGPG@@&7:B@@@@@@@@@@@@7^5@&~?Y55YJJ7^.                            
#                        .!?JYYY55J7^:..:~JGY.?@@@@@@@@@G.J&&BPY?!~~7?J?7!^:                          
#                      ~B@@@@@@@GJ7?J5PPP5J!~. ~@@@@@@@Y :77J5PPP5J!~~?B@@@@@&&B~                     
#                    7&@@@@@@#!^Y#@@@@@@@@@@@@#?^?&@@B~^5&@@@@@@@@@@@&G7^Y@@@@@@@&?                   
#                  7&@@@@@@&~^B@@@@@@@@@@@@@@@@@@5:7^~#@@@@@@@@@@@@@@@@@@J.5@@@@@@@@?                 
#                ^&@@@@@@@B.Y@@@@@@@@@@@@@@@@@@@@@@7P@@@@@@@@@@@@@@@@@@@@@&:^@@@@@@@@&^               
#               5@@@@@@@@B G@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~:@@@@@@@@@P              
#             .&@@@@@@@@@ Y@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.?@@@@@@@@@&:            
#            ^@@@@@@@@@@Y @@@@@@@@@@@@@@@@@&J!~7Y&@@@@#J!~75&@@@@@@@@@@@@@@@@G @@@@@@@@@@@~           
#           ^@@@@@@@@@@@:~@@@@@@@@@@@@@@@@~ ?7    ~@@~ ?!    !@@@@@@@@@@@@@@@@ B@@@@@@@@@@@~          
#          .@@@@@@@@@@@@:!@@@@@@@@@@@@@@@Y  J7     P5  J7     5@@@@@@@@@@@@@@@ G@@@@@@@@@@@@:         
#          &@@@@@&#BB&@@7.@@@@@@@@@@@@@@@#         &#         #@@@@@@@@@@@@@@# &@@&BB#&@@@@@@         
#         ~BGBB?~?5P5P@@& B@@@@@@@@@@@@@@@&7.   .7&@@&7.   .7&@@@@@@@@@@@@@@@^^@@@55P57~?BBGB!        
#       :?5P5  .7!^7@@@@@J.@@@@@@@@@@@@@@@@@@@&@@@@@@@@@@&@@@@@@@@@@@@@@@@@@5 &@@@@@!^!7.  PP5?:      
#     Y&@@@@@#&#!^7B@@@@@@?.&@@@@@@@@@@@@@@@@@@@P?77775&@@@@@@@@@@@@@@@@@@@Y.#@@@@@@G7^7#&#@@@@@&Y    
#   .&@@@@@@@@5:J5?^:@@@#&@P.J@@@@@@@@@@@@@@@@P:J&@@@&5:?@@@@@@@@@@@@@@@@#^^&@##@@&.~?5?:P@@@@@@@@&.  
#   &@@@@@@@@Y :!Y#.?&7^JB@@@J^?#@@@@@@@@@@@@@ 7@@@@@@@# &@@@@@@@@@@@@@G~^G@@@B?^?&!.#Y!: 5@@@@@@@@&  
#  7@@@@@@@@@7J&@@# ~ ^@@@@@@@@G7~?5B&&&&&#B5?^.J@@@@@@..~JG#&&&&&#GY!~J#@@@@@@@@^ ~ &@@#??@@@@@@@@@7 
#  P@@@@@@@@@@@@@@&:J.?@@@@@@@@@@@&G5J?JJJ7~^~7~.~&@@#.^7~:..^!JJJYPB&@@@@@@@@@@@?.?:@@@@@@@@@@@@@@@P 
#  P@@@@@@@@@@@@@@@@@ P@@@@@@@@@@@@@@@@&577YB&@@@Y.YJ.G@@@@&GJ!7P&@@@@@@@@@@@@@@@P @@@@@@@@@@@@@@@@@P 
#  J@@@@@@@@@@@@@@@@# &@@@@@@@@@@@@@@G~~P&@@@@@@@@&55@@@@@@@@@@&5~~B@@@@@@@@@@@@@& #@@@@@@@@@@@@@@@@J 
#  :@@@@@@@@@@@@@@@@5 @@@@@@@@@@@@@@& ?@@@@@@@@@@@@@@@@@@@@@@@@@@@..@@@@@@@@@@@@@@ 5@@@@@@@@@@@@@@@@: 
#   B@@@@@@@@@@@@@@@!:@@@@@@@@@@@@&Y^7@@@@@@@@@@@@@@@@@@@@@@@@@@@@&!^5@@@@@@@@@@@@:!@@@@@@@@@@@@@@@B  
#   :@@@@@@@@@@@@@@@:!@@@@@@@@@@&!^Y&@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&Y:7@@@@@@@@@@!:@@@@@@@@@@@@@@@:  
#    5@@@@@@@@@@@@@@.7@@@@@@@@@@P.:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&.^G@@@@@@@@@7.@@@@@@@@@@@@@@5   
#     #@@@@@@@@@@@@@:!@@@@@@@@@@@:!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&.7@@@@@@@@@@!:@@@@@@@@@@@@@#    
#      &@@@@@@@@@@@@!:@@@@@@@@@#.Y@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!:&@@@@@@@@:!@@@@@@@@@@@@&     
#       B@@@@@@@@@@@G @@@@@@@@& ~&@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&^ &@@@@@@@ G@@@@@@@@@@@B      
#        J@@@@@@@@@@@ J@@@@@@@#JP.Y@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&.?5?&@@@@@@J @@@@@@@@@@@J       
#         .B@@@@@@@@@G &@@@@@@@@@ P@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@& P@@@@@@@@& G@@@@@@@@@B.        
#           :G@@@@@@@@7.@@@@@@@@7.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@B #@@@@@@@.7@@@@@@@@G:          
#             .J&@@@@@@7.&@@@@@@ :P@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#P.:@@@@@&.7@@@@@@&J.            
#                .?B&@@@P.G@@@@@BB7.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@J.GGB@@@@G.P@@@&B?.               
#                    .~?P7 P@@@@@@@.!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ P@@@@@@P 7P?~.                   
#                          Y&@@@@@@# P@@@@@@@@@@@@@@@@@@@@@@@@@@@@@? @@@@@@&Y                         
#                            :JB@@@@#7?~7#@@@@@@@@@@@@@@@@@@@@@B!!??&@@@#J:                           
#                                :?P#@@@B^!#@&&&@@@@@@@@@&&&@#~~#@@&P?^                               
#                                   77~~Y5~.:!7~~7P#&#P!^~!~. ~J7.!J?                                 
#                                  #@@^^&BG5J.^?!.     .!J^.YGB&&:~@@&                                
#                                 ^@@& #@@@@@^^@@@     &@@:!@@@@@B &@@!                               
#                                 :@@@ G@@@@@:!@@&     #@@~^@@@@@P @@@^                               
#                                  J@@Y.&@@@Y.&@&^     :&@& Y@@@#.5@@Y                                
#                                   .!~  ~!.  !~         ~7  :7^  ~!.                                 '''
# print(login)
# print(id(login))
# print(password)
# print(id(password))
# print(line)
# print(line2)
# print(raw_line)
# print(img)
# print(''' 
# I 
#     Love 
#             Python''')

myStr = "football"
print(myStr)
print(myStr[0])
print(myStr[2])
print(myStr[3])
print(myStr[7])
#print(myStr[len(myStr)])
print("Length of string ", len(myStr))
print(len(myStr)-1)
print(myStr[-1])
#конкатенація (додавання)
line1 = "Hello, "
line2 = "world"
line3 = "red"
print(line1 + line2)
line4 = line1 + line2 + line3
print(line4)
 
#дублювання рядків - оператор *
# str = "Hello"
# print(str*5)
# myBigStr = str *10
# print(myBigStr)
# #визначення довжини рядка
# str = "Hello world"
# print(f"Length of string : {len(str)}")

#name text ..... name text .... age name text
name = "Nazar"
age = 22
#formatLine = name + "text......" + name + "text....." + age + "text....."
#formatLine = name + "text......" + name + "text....." + str(age) + "text....."
#formatLine = name , "text......" , name , "text....." , age , "text....."
#formatLine = "{}  text...... {} text..... {}  text.....  {}".format(name,name,age,name)
#formatLine = "{0}  text...... {0} text..... {1}  text.....  {0}".format(name,age)
formatLine = f"{name}  text...... {name} text..... {age}  text.....  {name}"
print(formatLine)

salary = 108.485
#strMsg = "Your salary is {0:19.2f}".format(salary)
strMsg = f"Your salary is {salary:10.3f}"
print(strMsg)
a = -10
b = 10
strMsg2 = f"The number is in range : from {a:-} to {b:+}"
print(strMsg2)
points = 100
strMsg3 = f"You have {points:< 15} points . "
print(strMsg3)
strMsg3 = f"You have {points:> 15} points . "
print(strMsg3)
strMsg3 = f"You have {points:^ 15} points . "
print(strMsg3)

line = "Lorem ipsum"
print(line)
print(id(line))
line += "!!!!!!"
print(line)
print(id(line))

testline = "Hello"
print(testline)
print(id(testline))
testline = "world"
print(testline)
print(id(testline))

for i in range(10000):
    print(f"{i} --> {chr(i)} " , end="\t")
    if i%7== 0:
        print()

print(ord('A'))
print(ord('b'))
print(chr(9556))
print(chr(9552)*30)